Revit 2022 API
AnalyticalModelSketchComponent.GetAnalyticalProjectionType Method
 Retrieves Analytical Projection Type preset for Sketch Component.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2011
Syntax
C#
public AnalyticalProjectionType GetAnalyticalProjectionType()
Visual Basic
Public Function GetAnalyticalProjectionType As AnalyticalProjectionType
Visual C++
public:
AnalyticalProjectionType GetAnalyticalProjectionType()
Return Value
 Indicates whether Analytical Projection is at a preset, or refers to a Datum.
See Also
AnalyticalModelSketchComponent Class
Autodesk.Revit.DB.Structure Namespace